{
  "movies": [
    {
      "id": "m1",
      "title": "Pather Panchali",
      "subtitle": "Satyajit Ray, 1955",
      "image": "images/pather_panchali.png",
      "technicianReview": "Shot on a shoestring budget with a first-time crew. Subrata Mitra invented 'bounce lighting' for this film to mimic daylight. The visuals are raw, poetic, and texture-heavy.",
      "soulNote": "A child's view of the world where poverty doesn't strip away wonder. The train scene is a timeless metaphor for the distance between dreams and reality.",
      "significance": "In our era of high-speed digital consumption, Ray's masterpiece teaches us the radical act of patience. It reminds us that dignity is not a function of wealth.",
      "defaultContext": "\"The train is coming! The train!\"",
      "artistFact": "Satyajit Ray pawned his wife's jewelry to fund the film. When funds ran dry, the production stopped for a year.",
      "tags": [
        "patience",
        "poverty",
        "childhood",
        "humanism",
        "hope"
      ]
    },
    {
      "id": "m2",
      "title": "Parasite",
      "subtitle": "Bong Joon-ho, 2019",
      "image": "images/parasite.png",
      "technicianReview": "A masterclass in blocking and set design. The entire house was built to serve the camera movements. Every frame emphasizes the vertical hierarchy of class.",
      "soulNote": "It exposes the polite violence of capitalism. A thriller that leaves you laughing until you realize the joke is on all of us.",
      "significance": "As the wealth gap widens globally, 'Parasite' remains the definitive cinematic text of our time.",
      "defaultContext": "\"It's so metaphorical.\"",
      "artistFact": "The Parks' house was an open set built in a tank, designed based on the sun's trajectory.",
      "tags": [
        "class",
        "capitalism",
        "inequality",
        "thriller",
        "architecture"
      ]
    },
    {
      "id": "m3",
      "title": "Apocalypse Now",
      "subtitle": "F.F. Coppola, 1979",
      "image": "images/apocalypse_now.png",
      "technicianReview": "Walter Murch invented 'Sound Design' for this film. The helicopter blades blending with the ceiling fan is the definitive example of sonic psychological transition.",
      "soulNote": "It stares directly into the heart of darkness. It forces you to witness how fragile morality is when stripped of civilization.",
      "significance": "Coppola's fever dream drags us back to the visceral, madness-inducing reality of conflict.",
      "defaultContext": "\"I love the smell of napalm in the morning.\"",
      "artistFact": "The production was a disaster. Sets were destroyed by a typhoon and Martin Sheen had a heart attack on set.",
      "tags": [
        "war",
        "chaos",
        "psychology",
        "madness",
        "conflict"
      ]
    },
    {
      "id": "m4",
      "title": "In the Mood for Love",
      "subtitle": "Wong Kar-wai, 2000",
      "image": "images/in_the_mood_for_love.png",
      "technicianReview": "Christopher Doyle's use of color saturation and framing creates a claustrophobic intimacy.",
      "soulNote": "The most romantic film ever made where nothing happens. It captures the eternal ache of 'what if'.",
      "significance": "Wong Kar-wai celebrates the agonizing beauty of restraint.",
      "defaultContext": "\"That era has passed.\"",
      "artistFact": "Wong Kar-wai shot so much footage that he originally planned a 4-hour epic and worked without a finished script.",
      "tags": [
        "love",
        "romance",
        "memory",
        "restraint",
        "nostalgia"
      ]
    },
    {
      "id": "m5",
      "title": "Mirror",
      "subtitle": "Andrei Tarkovsky, 1975",
      "image": "images/mirror.png",
      "technicianReview": "A non-linear editing marvel. Tarkovsky creates a logic of dreams rather than narrative.",
      "soulNote": "It feels like remembering a life you never lived. A poetic meditation on childhood.",
      "significance": "Tarkovsky insists that the past is not dead; it is a living texture.",
      "defaultContext": "\"Words can't express a person's whole vividness.\"",
      "artistFact": "Tarkovsky reconstructed his childhood home from old photographs down to the exact plants in the garden.",
      "tags": [
        "memory",
        "childhood",
        "dream",
        "history",
        "poetry"
      ]
    },
    {
      "id": "m6",
      "title": "2001: A Space Odyssey",
      "subtitle": "Stanley Kubrick, 1968",
      "image": "images/2001.png",
      "technicianReview": "Pre-CGI visual effects that still hold up. The slit-scan technique for the Stargate sequence was revolutionary.",
      "soulNote": "A cold, terrifying look at our place in the cosmos. It asks if we are the masters of our tools or their victims.",
      "significance": "As AI advances, HAL 9000 becomes less of a villain and more of a prophecy.",
      "defaultContext": "\"I'm sorry, Dave. I'm afraid I can't do that.\"",
      "artistFact": "Kubrick had the set completely destroyed after filming so the props couldn't be used in lesser sci-fi films.",
      "tags": [
        "tech",
        "future",
        "space",
        "ai",
        "isolation"
      ]
    },
    {
      "id": "m7",
      "title": "Do the Right Thing",
      "subtitle": "Spike Lee, 1989",
      "image": "images/do_the_right_thing.png",
      "technicianReview": "The use of Dutch angles and a saturated warm color palette makes the heatwave physically palpable.",
      "soulNote": "A pressure cooker of racial tension that refuses to give easy answers. It demands you pick a side.",
      "significance": "Decades later, the tragedy of Radio Raheem feels like it could have been filmed yesterday on an iPhone.",
      "defaultContext": "\"Always do the right thing.\"",
      "artistFact": "Obama took Michelle to see this movie on their first date.",
      "tags": [
        "justice",
        "society",
        "race",
        "heat",
        "conflict"
      ]
    },
    {
      "id": "m8",
      "title": "Portrait of a Lady on Fire",
      "subtitle": "Céline Sciamma, 2019",
      "image": "images/lady_on_fire.png",
      "technicianReview": "Shot in 8K but with zero music score until the very end. The sound of the wind and fire replaces the orchestra.",
      "soulNote": "A study of the female gaze. It shows love not as possession, but as the act of truly seeing someone.",
      "significance": "It reclaims the muse from being an object and makes her an active participant in the creation of art.",
      "defaultContext": "\"Do all lovers feel they're inventing something?\"",
      "artistFact": "The lead actresses were ex-lovers in real life, adding a layer of genuine history and tenderness to their performance.",
      "tags": [
        "love",
        "art",
        "gaze",
        "history",
        "women"
      ]
    },
    {
      "id": "m9",
      "title": "Stalker",
      "subtitle": "Andrei Tarkovsky, 1979",
      "image": "images/stalker.png",
      "technicianReview": "Filmed in hazardous locations. The long takes induce a trance-like state, forcing the viewer to alter their breathing.",
      "soulNote": "A journey into the Zone where your deepest wish is granted—and that is the most terrifying thing of all.",
      "significance": "It predicts the spiritual void of the modern world and our desperate, dangerous search for meaning.",
      "defaultContext": "\"The direct path is not the safest.\"",
      "artistFact": "The film was actually shot twice. The first version's negatives were destroyed in a lab accident, forcing Tarkovsky to reshoot the entire movie with a lower budget.",
      "tags": [
        "spirituality",
        "fear",
        "wish",
        "dystopia",
        "philosophy"
      ]
    },
    {
      "id": "m10",
      "title": "Blade Runner",
      "subtitle": "Ridley Scott, 1982",
      "image": "images/blade_runner.png",
      "technicianReview": "The definitive Cyberpunk aesthetic. The lighting through smoke and rain created a 'future noir' look that has been copied for 40 years.",
      "soulNote": "It asks what it means to be human. If a machine can love and fear death, does it have a soul?",
      "significance": "As we enter the age of synthetic biology, the question of 'more human than human' is no longer fiction.",
      "defaultContext": "\"Tears in rain.\"",
      "artistFact": "Philip K. Dick, who wrote the source novel, was so impressed by the special effects test reel that he said, 'It was my own interior world. They caught it perfectly.'",
      "tags": [
        "tech",
        "future",
        "soul",
        "noir",
        "identity"
      ]
    }
  ],
  "music": [
    {
      "id": "mu1",
      "title": "Buena Vista Social Club",
      "subtitle": "BVSC, 1997",
      "image": "images/buena_vista.png",
      "technicianReview": "Recorded in six days in Havana using vintage tube mics. The lack of separation creates a warm, communal room sound.",
      "soulNote": "It proves that passion has no expiration date.",
      "significance": "This album is a defiant monument to the beauty of aging.",
      "defaultContext": "\"De Alto Cedro voy para Marcané.\"",
      "artistFact": "Ibrahim Ferrer was shining shoes to make a living before being asked to record the vocals.",
      "tags": [
        "aging",
        "passion",
        "history",
        "warmth",
        "analog"
      ]
    },
    {
      "id": "mu2",
      "title": "Sounds of India",
      "subtitle": "Ravi Shankar, 1968",
      "image": "images/ravi_shankar.png",
      "technicianReview": "A pristine capture of complex ragas. The recording balances the sympathetic resonance of the sitar with the punch of the tabla perfectly.",
      "soulNote": "Music as meditation. It doesn't follow Western verse-chorus structure but flows like a river.",
      "significance": "Indian Classical music demands deep listening, the antidote to the 3-minute pop song.",
      "defaultContext": "\"Raga is a form that cannot be separated from the divine.\"",
      "artistFact": "Ravi Shankar famously gave George Harrison sitar lessons.",
      "tags": [
        "meditation",
        "focus",
        "spirituality",
        "tradition",
        "peace"
      ]
    },
    {
      "id": "mu3",
      "title": "Grace",
      "subtitle": "Jeff Buckley, 1994",
      "image": "images/jeff_buckley.png",
      "technicianReview": "The vocal control is technically perfect, spanning four octaves. The reverb on the guitar creates a cathedral-like space.",
      "soulNote": "Pure, unfiltered emotion. It sounds like a man singing for his life.",
      "significance": "Buckley's raw vulnerability is startling in an era of auto-tune.",
      "defaultContext": "\"There's the moon asking to stay.\"",
      "artistFact": "Buckley drowned during a spontaneous evening swim in the Mississippi River, fully clothed, singing Led Zeppelin.",
      "tags": [
        "vulnerability",
        "emotion",
        "love",
        "tragedy",
        "raw"
      ]
    },
    {
      "id": "mu4",
      "title": "A Love Supreme",
      "subtitle": "John Coltrane, 1965",
      "image": "images/coltrane.png",
      "technicianReview": "Recorded in one session. The interplay between Elvin Jones and Coltrane is telepathic.",
      "soulNote": "A spiritual ascension. It vibrates with gratitude.",
      "significance": "Coltrane's unashamed declaration of gratitude to a higher power is a radical act.",
      "defaultContext": "\"A Love Supreme. A Love Supreme.\"",
      "artistFact": "Coltrane locked himself in his bedroom for five days to compose this album.",
      "tags": [
        "spirituality",
        "gratitude",
        "divine",
        "jazz",
        "intensity"
      ]
    },
    {
      "id": "mu5",
      "title": "Homogenic",
      "subtitle": "Björk, 1997",
      "image": "images/bjork.png",
      "technicianReview": "A fusion of tectonic beats and lush strings. The distortion is deliberate.",
      "soulNote": "It captures the strength of the solitary heart.",
      "significance": "Björk foresaw our cyborg future. She showed us that machines and nature are not enemies but lovers.",
      "defaultContext": "\"Emotional landscapes.\"",
      "artistFact": "Björk recorded vocals outside, sometimes while running, to capture raw energy.",
      "tags": [
        "nature",
        "technology",
        "emotion",
        "landscape",
        "future"
      ]
    },
    {
      "id": "mu6",
      "title": "Dark Side of the Moon",
      "subtitle": "Pink Floyd, 1973",
      "image": "images/pink_floyd.png",
      "technicianReview": "Alan Parsons used tape loops and physical editing to create seamless transitions. A benchmark for studio engineering.",
      "soulNote": "A guided tour through the madness of modern life: time, money, and war.",
      "significance": "It remains the ultimate album about the human condition under capitalism.",
      "defaultContext": "\"There is no dark side of the moon really.\"",
      "artistFact": "The album remained on the Billboard charts for 741 consecutive weeks—over 14 years.",
      "tags": [
        "society",
        "madness",
        "time",
        "capitalism",
        "tech"
      ]
    },
    {
      "id": "mu7",
      "title": "To Pimp a Butterfly",
      "subtitle": "Kendrick Lamar, 2015",
      "image": "images/kendrick.png",
      "technicianReview": "A dense collage of free jazz, funk, and spoken word. The mixing is intentionally chaotic to mirror the internal conflict.",
      "soulNote": "A scream of black excellence and trauma. It is therapy recorded on tape.",
      "significance": "The defining protest album of the 21st century.",
      "defaultContext": "\"We gon' be alright.\"",
      "artistFact": "Kendrick originally planned to name the album 'Tu Pimp A Caterpillar' to form the acronym T.U.P.A.C.",
      "tags": [
        "justice",
        "society",
        "race",
        "jazz",
        "chaos"
      ]
    },
    {
      "id": "mu8",
      "title": "Kid A",
      "subtitle": "Radiohead, 2000",
      "image": "images/radiohead.png",
      "technicianReview": "Abandoning guitars for Ondes Martenots and modular synths. It sounds like a computer trying to learn how to cry.",
      "soulNote": "The soundtrack to the dissociation of the internet age. It captures the feeling of being overwhelmed by data.",
      "significance": "It predicted the anxiety of the information era long before social media took over.",
      "defaultContext": "\"Everything in its right place.\"",
      "artistFact": "Thom Yorke almost quit music before this album due to severe depression and writer's block.",
      "tags": [
        "tech",
        "anxiety",
        "future",
        "alienation",
        "experiment"
      ]
    },
    {
      "id": "mu9",
      "title": "Blue",
      "subtitle": "Joni Mitchell, 1971",
      "image": "images/blue.png",
      "technicianReview": "Stripped back to just dulcimer and piano. The microphone placement captures every breath and lip smack.",
      "soulNote": "The most honest breakup album ever made. It feels like reading someone's diary.",
      "significance": "In a world of curated Instagram lives, 'Blue' dares to be messy and pathetic in the most beautiful way.",
      "defaultContext": "\"I am on a lonely road and I am traveling.\"",
      "artistFact": "Mitchell said of this album, 'I felt like I had absolutely no secrets from the world and I couldn't pretend in my life to be strong.'",
      "tags": [
        "love",
        "heartbreak",
        "vulnerability",
        "travel",
        "folk"
      ]
    },
    {
      "id": "mu10",
      "title": "Kind of Blue",
      "subtitle": "Miles Davis, 1959",
      "image": "images/miles.png",
      "technicianReview": "Recorded with almost no rehearsal. The tape hiss is part of the atmosphere.",
      "soulNote": "Coolness personified. It is the sound of 3 AM in a city that understands you.",
      "significance": "It defined 'cool' for the 20th century and taught us that what you don't play is as important as what you do.",
      "defaultContext": "\"So What.\"",
      "artistFact": "Miles gave the musicians only sketches of scales and melodies hours before recording.",
      "tags": [
        "jazz",
        "cool",
        "city",
        "improvisation",
        "night"
      ]
    }
  ],
  "books": [
    {
      "id": "b1",
      "title": "God of Small Things",
      "subtitle": "Arundhati Roy, 1997",
      "image": "images/small_things.png",
      "technicianReview": "A linguistic tour de force. Roy creates her own vocabulary to describe the indescribable.",
      "soulNote": "A devastating look at how Big Things crush Small Things.",
      "significance": "Roy insists on the complexity of the 'Small Things' in a polarized world.",
      "defaultContext": "\"Things can change in a day.\"",
      "artistFact": "Arundhati Roy trained as an architect before writing the novel.",
      "tags": [
        "politics",
        "love",
        "trauma",
        "society",
        "justice"
      ]
    },
    {
      "id": "b2",
      "title": "Kafka on the Shore",
      "subtitle": "Haruki Murakami, 2002",
      "image": "images/kafka.png",
      "technicianReview": "Master of the metaphysical split-narrative. The translation captures the dream logic perfectly.",
      "soulNote": "A labyrinth of the subconscious. It asks if we can escape our destiny.",
      "significance": "Murakami validates our confusion in a surreal reality.",
      "defaultContext": "\"The world is a metaphor.\"",
      "artistFact": "Murakami wakes up at 4:00 AM every day and writes for five to six hours.",
      "tags": [
        "dream",
        "subconscious",
        "surreal",
        "destiny",
        "mystery"
      ]
    },
    {
      "id": "b3",
      "title": "100 Years of Solitude",
      "subtitle": "G.G. Márquez, 1967",
      "image": "images/solitude.png",
      "technicianReview": "The definitive text of Magical Realism. The prose style mimics the cyclical nature of history.",
      "soulNote": "It teaches us that time is not linear, but a circle.",
      "significance": "A cautionary tale about the isolation that comes from power.",
      "defaultContext": "\"He really had been through death.\"",
      "artistFact": "Márquez sold his car and pawned his household appliances to support his family while writing.",
      "tags": [
        "history",
        "cycle",
        "war",
        "family",
        "magic"
      ]
    },
    {
      "id": "b4",
      "title": "Dune",
      "subtitle": "Frank Herbert, 1965",
      "image": "images/dune.png",
      "technicianReview": "World-building at its finest. It's a complex system manual disguised as narrative.",
      "soulNote": "It teaches us about fear. 'Fear is the mind-killer.'",
      "significance": "The ultimate text on ecology and resource scarcity.",
      "defaultContext": "\"Fear is the mind-killer.\"",
      "artistFact": "Dune was rejected by over 20 publishers before being accepted by a company that printed car repair manuals.",
      "tags": [
        "ecology",
        "politics",
        "fear",
        "leadership",
        "survival"
      ]
    },
    {
      "id": "b5",
      "title": "Master and Margarita",
      "subtitle": "Mikhail Bulgakov, 1967",
      "image": "images/master_margarita.png",
      "technicianReview": "A satirical masterpiece written in secret. The tone shifts from slapstick to biblical tragedy.",
      "soulNote": "Proof that manuscripts don't burn.",
      "significance": "Written under tyranny, it is a testament to the fact that truth cannot be censored forever.",
      "defaultContext": "\"Manuscripts don't burn.\"",
      "artistFact": "Bulgakov burned the first manuscript of the novel in a stove, fearing a police raid.",
      "tags": [
        "censorship",
        "truth",
        "magic",
        "satire",
        "love"
      ]
    },
    {
      "id": "b6",
      "title": "Invisible Man",
      "subtitle": "Ralph Ellison, 1952",
      "image": "images/invisible_man.png",
      "technicianReview": "The jazz-influenced prose style shifts rhythm to match the protagonist's chaotic journey.",
      "soulNote": "A harrowing look at what it means to be seen but not known.",
      "significance": "It remains the essential American novel about race and identity.",
      "defaultContext": "\"I am invisible, understand, because people refuse to see me.\"",
      "artistFact": "Ellison spent seven years writing the novel, working on it in a friend's photography studio.",
      "tags": [
        "race",
        "identity",
        "society",
        "jazz",
        "invisibility"
      ]
    },
    {
      "id": "b7",
      "title": "The Road",
      "subtitle": "Cormac McCarthy, 2006",
      "image": "images/the_road.png",
      "technicianReview": "Minimalist punctuation and stark prose create a landscape of absolute desolation.",
      "soulNote": "A love story between a father and son at the end of the world.",
      "significance": "As climate anxiety grows, this book forces us to ask what is worth saving when everything is gone.",
      "defaultContext": "\"Carry the fire.\"",
      "artistFact": "McCarthy got the idea for the book while looking out a hotel window at night in El Paso with his sleeping son.",
      "tags": [
        "survival",
        "love",
        "future",
        "fear",
        "hope"
      ]
    },
    {
      "id": "b8",
      "title": "Slaughterhouse-Five",
      "subtitle": "Kurt Vonnegut, 1969",
      "image": "images/slaughterhouse.png",
      "technicianReview": "A non-linear anti-war novel that uses sci-fi tropes to process PTSD.",
      "soulNote": "A resigned shrug at the absurdity of death.",
      "significance": "It creates a language for trauma that traditional narrative cannot handle.",
      "defaultContext": "\"So it goes.\"",
      "artistFact": "Vonnegut actually survived the firebombing of Dresden as a POW by hiding in a meat locker.",
      "tags": [
        "war",
        "trauma",
        "time",
        "satire",
        "peace"
      ]
    },
    {
      "id": "b9",
      "title": "The Handmaid's Tale",
      "subtitle": "Margaret Atwood, 1985",
      "image": "images/handmaid.png",
      "technicianReview": "Speculative fiction that relies only on historical precedents. Nothing in the book hasn't happened somewhere before.",
      "soulNote": "A terrifying warning about how quickly freedom can be traded for security.",
      "significance": "It has become the primary symbol for women's rights protests globally.",
      "defaultContext": "\"Nolite te bastardes carborundorum.\"",
      "artistFact": "Atwood wrote the book in West Berlin in 1984, hearing the sonic booms of Soviet fighter jets.",
      "tags": [
        "politics",
        "society",
        "women",
        "dystopia",
        "freedom"
      ]
    },
    {
      "id": "b10",
      "title": "In Search of Lost Time",
      "subtitle": "Marcel Proust, 1913",
      "image": "images/proust.png",
      "technicianReview": "The sentences are architectural marvels, designed to capture the exact texture of a fleeting thought.",
      "soulNote": "The ultimate study of memory and how we construct our own reality.",
      "significance": "In an age of short attention spans, Proust demands we slow down and truly notice our lives.",
      "defaultContext": "\"The only true paradise is paradise lost.\"",
      "artistFact": "Proust wrote the last volumes while bedridden in a cork-lined bedroom to block out all noise.",
      "tags": [
        "memory",
        "time",
        "art",
        "love",
        "society"
      ]
    }
  ]
}